In [1]:
# Importamos las librerías que necesitamos

# Tratamiento de datos
import pandas as pd
import numpy as np

# Visualización
import matplotlib.pyplot as plt
import seaborn as sns

# Ocultamos las advertencias para evitar mensajes innecesarios
import warnings
warnings.filterwarnings("ignore")

# Configuración
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [2]:
# Lo primero que hacemos es cargar el dataframe que vamos a usar
df = pd.read_csv("spaces_hr_raw_data.csv")
df.head()

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [3]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'over18', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament',
       'numberchildren', 'remotework'],
      dtype='object')

In [4]:
df = df.drop(columns=['numberchildren', 'over18', 'yearsincurrentrole'])

In [5]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [6]:
def exploracion_basica(df):
    print("=== EXPLORACIÓN BÁSICA DEL DATASET ===")
    print("\nPrimeras filas:")
    print(df.head())
    print("\nÚltimas filas:")
    print(df.tail())
    print("\nNúmero de filas y columnas:")
    print(df.shape)
    print("\nInformación general del DataFrame:")
    print(df.info())
    print("\nEstadísticas descriptivas:")
    print(df.describe())
    print("\nColumnas:")
    print(list(df.columns))

In [7]:
exploracion_basica(df)

=== EXPLORACIÓN BÁSICA DEL DATASET ===

Primeras filas:
   Unnamed: 0 age attrition businesstravel    dailyrate  \
0           0  51        No            NaN  2015.722222
1           1  52        No            NaN  2063.388889
2           2  42        No  travel_rarely  1984.253968
3           3  47        No  travel_rarely  1771.404762
4           4  46        No            NaN  1582.771346

                 department  distancefromhome  education    educationfield  \
0                       NaN                 6          3               NaN
1                       NaN                 1          4     Life Sciences
2   Research & Development                  4          2  Technical Degree
3                       NaN                 2          4           Medical
4                       NaN                 3          3  Technical Degree

   employeecount  employeenumber  environmentsatisfaction  gender  hourlyrate  \
0              1               1                        1       0         NaN
1              1               2                        3       0         NaN
2              1               3                        3       0         NaN
3              1               4                        1       1         NaN
4              1               5                        1       1         NaN

   jobinvolvement  joblevel              jobrole  jobsatisfaction  \
0               3         5   resEArch DIREcToR                 3
1               2         5             ManAGeR                 3
2               3         5             ManaGER                 4
3               3         4   ReseArCH DIrECtOr                 3
4               4         4     sAleS EXECUtIve                 1

  maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
0           NaN     16280,83$   42330,17$                   7       No
1           NaN           NaN   43331,17$                   0      NaN
2       Married           NaN   41669,33$                   1       No
3       Married     14307,50$   37199,50$                   3      NaN
4      Divorced     12783,92$   33238,20$                   2       No

   percentsalaryhike performancerating  relationshipsatisfaction  \
0                 13               3,0                         3
1                 14               3,0                         1
2                 11               3,0                         4
3                 19               3,0                         2
4                 12               3,0                         4

  standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
0     Full Time                 0               NaN                      5
1           NaN                 1              34,0                      5
2           NaN                 0              22,0                      3
3     Full Time                 2               NaN                      2
4           NaN                 1               NaN                      5

  worklifebalance  yearsatcompany  yearssincelastpromotion  \
0             3,0              20                       15
1             3,0              33                       11
2             NaN              22                       11
3             NaN              20                        5
4             3,0              19                        2

   yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
0                    15           16280,83$       1972  195370,00$
1                     9                 NaN       1971  199990,00$
2                    15                 NaN       1981  192320,00$
3                     6           14307,50$       1976  171690,00$
4                     8           12783,92$       1977         NaN

                        roledepartament remotework
0                                   NaN        Yes
1                                   NaN          1
2   ManaGER  -  Research & Development           1
3                                   NaN      False
4                                   NaN          0

Últimas filas:
      Unnamed: 0 age attrition businesstravel    dailyrate department  \
1673        1673  43        No            NaN   488.944444        NaN
1674        1674  47        No            NaN  1973.984127        NaN
1675        1675  29        No  travel_rarely   290.035510        NaN
1676        1676  47        No  travel_rarely  1032.487286        NaN
1677        1677  32        No            NaN   556.256661        NaN

      distancefromhome  education educationfield  employeecount  \
1673               -26          3        Medical              1
1674                26          4            NaN              1
1675                15          3            NaN              1
1676                 4          3  Life Sciences              1
1677                 2          2  Life Sciences              1

      employeenumber  environmentsatisfaction  gender  hourlyrate  \
1673             824                        2       1         NaN
1674            1087                        4       1         NaN
1675             528                        3       0         NaN
1676              76                        3       1         NaN
1677             401                        4       1   69.532083

      jobinvolvement  joblevel                   jobrole  jobsatisfaction  \
1673               4         1       rESEaRcH SciEnTiST                 3
1674               3         5                  mANager                 3
1675               3         1       reSearch sCienTiSt                 4
1676               2         3   maNufACTURING DIREctOr                 2
1677               3         2       resEArch scIENTisT                 3

     maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
1673        Single      3949,17$   10267,83$                   4      NaN
1674       Married     15943,72$   41453,67$                   3       No
1675           NaN           NaN    6090,75$                   1       No
1676      Divorced      8339,32$   21682,23$                   8      Yes
1677        Single           NaN   11681,39$                   4      Yes

      percentsalaryhike performancerating  relationshipsatisfaction  \
1673                 12               3,0                         4
1674                 11               3,0                         3
1675                 19               3,0                         1
1676                 12               NaN                         3
1677                 14               3,0                         4

     standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
1673           NaN                 0               NaN                      2
1674     Full Time                 1              27,0                      2
1675     Part Time                 0               6,0                      1
1676     Part Time                 1               NaN                      4
1677     Part Time                 0              10,0                      2

     worklifebalance  yearsatcompany  yearssincelastpromotion  \
1673             3,0               3                        1
1674             3,0               5                        1
1675             3,0               6                        1
1676             3,0              22                       14
1677             3,0               8                        0

      yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
1673                     2            3949,17$       1980         NaN
1674                     0           15943,72$       1976  191324,62$
1675                     5                 NaN       1994   28111,13$
1676                    10            8339,32$       1976  100071,84$
1677                     7                 NaN       1991   53914,11$

     roledepartament remotework
1673             NaN        Yes
1674             NaN      False
1675             NaN      False
1676             NaN        Yes
1677             NaN          0

Número de filas y columnas:
(1678, 39)

Información general del DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1678 entries, 0 to 1677
Data columns (total 39 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Unnamed: 0                1678 non-null   int64
 1   age                       1678 non-null   object
 2   attrition                 1678 non-null   object
 3   businesstravel            877 non-null    object
 4   dailyrate                 1678 non-null   float64
 5   department                312 non-null    object
 6   distancefromhome          1678 non-null   int64
 7   education                 1678 non-null   int64
 8   educationfield            904 non-null    object
 9   employeecount             1678 non-null   int64
 10  employeenumber            1678 non-null   int64
 11  environmentsatisfaction   1678 non-null   int64
 12  gender                    1678 non-null   int64
 13  hourlyrate                411 non-null    float64
 14  jobinvolvement            1678 non-null   int64
 15  joblevel                  1678 non-null   int64
 16  jobrole                   1678 non-null   object
 17  jobsatisfaction           1678 non-null   int64
 18  maritalstatus             1003 non-null   object
 19  monthlyincome             1189 non-null   object
 20  monthlyrate               1678 non-null   object
 21  numcompaniesworked        1678 non-null   int64
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearssincelastpromotion   1678 non-null   int64
 33  yearswithcurrmanager      1678 non-null   int64
 34  sameasmonthlyincome       1189 non-null   object
 35  datebirth                 1678 non-null   int64
 36  salary                    1393 non-null   object
 37  roledepartament           312 non-null    object
 38  remotework                1678 non-null   object
dtypes: float64(2), int64(19), object(18)
memory usage: 511.4+ KB
None

Estadísticas descriptivas:
        Unnamed: 0    dailyrate  distancefromhome    education  employeecount  \
count  1678.000000  1678.000000       1678.000000  1678.000000         1678.0
mean    838.500000   668.079714          4.504172     2.932658            1.0
std     484.541192   470.787298         14.652066     1.024270            0.0
min       0.000000   104.103175        -49.000000     1.000000            1.0
25%     419.250000   290.035510          2.000000     2.000000            1.0
50%     838.500000   556.256661          5.000000     3.000000            1.0
75%    1257.750000   971.956349         11.000000     4.000000            1.0
max    1677.000000  2063.388889         29.000000     5.000000            1.0

       employeenumber  environmentsatisfaction       gender  hourlyrate  \
count     1678.000000              1678.000000  1678.000000  411.000000
mean       809.859952                 4.264005     0.398689   83.140768
std        467.084867                 6.912695     0.489774   57.272101
min          1.000000                 1.000000     0.000000   13.012897
25%        403.250000                 2.000000     0.000000   36.254439
50%        813.500000                 3.000000     0.000000   69.532083
75%       1215.750000                 4.000000     1.000000  116.987103
max       1614.000000                49.000000     1.000000  255.963294

       jobinvolvement     joblevel  jobsatisfaction  numcompaniesworked  \
count     1678.000000  1678.000000      1678.000000         1678.000000
mean         2.740763     2.064362         2.743147            2.670441
std          0.710359     1.099425         1.105172            2.501133
min          1.000000     1.000000         1.000000            0.000000
25%          2.000000     1.000000         2.000000            1.000000
50%          3.000000     2.000000         3.000000            2.000000
75%          3.000000     3.000000         4.000000            4.000000
max          4.000000     5.000000         4.000000            9.000000

       percentsalaryhike  relationshipsatisfaction  stockoptionlevel  \
count        1678.000000               1678.000000       1678.000000
mean           15.154350                  2.700238          0.787843
std             3.649607                  1.079494          0.843252
min            11.000000                  1.000000          0.000000
25%            12.000000                  2.000000          0.000000
50%            14.000000                  3.000000          1.000000
75%            18.000000                  4.000000          1.000000
max            25.000000                  4.000000          3.000000

       trainingtimeslastyear  yearsatcompany  yearssincelastpromotion  \
count            1678.000000     1678.000000              1678.000000
mean                2.795590        7.124553                 2.241955
std                 1.288657        6.173837                 3.246554
min                 0.000000        0.000000                 0.000000
25%                 2.000000        3.000000                 0.000000
50%                 3.000000        5.000000                 1.000000
75%                 3.000000        9.000000                 3.000000
max                 6.000000       40.000000                15.000000

       yearswithcurrmanager    datebirth
count           1678.000000  1678.000000
mean               4.200238  1986.047080
std                3.554224     9.154908
min                0.000000  1963.000000
25%                2.000000  1980.000000
50%                3.000000  1987.000000
75%                7.000000  1993.000000
max               17.000000  2005.000000

Columnas:
['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate', 'department', 'distancefromhome', 'education', 'educationfield', 'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime', 'percentsalaryhike', 'performancerating', 'relationshipsatisfaction', 'standardhours', 'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion', 'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament', 'remotework']

In [8]:
# Variables con valores nulos
def nulls(df,count=0,share=0):
    
    nulls = df.isnull().sum()
    nulls_share = df.isnull().sum()/df.shape[0]*100
    with_nulls_share = nulls_share[nulls_share > 0]
    
    if count == 1:
        print('Count of nulls')
        with_nulls = nulls[nulls > 0]
        print (with_nulls.sort_values(ascending=False))
        print('-----------------------------------')
    
    if share == 1:
        print('share of nulls')
        print (with_nulls_share.sort_values(ascending=False))
    
    nulls_list = with_nulls_share.to_frame(name='perc_nulos').reset_index().rename(columns={'index': 'var'})
    
    return nulls_list

In [9]:
nulls(df,1,1)

Count of nulls
department             1366
roledepartament        1366
hourlyrate             1267
businesstravel          801
educationfield          774
overtime                696
maritalstatus           675
totalworkingyears       549
monthlyincome           489
sameasmonthlyincome     489
standardhours           351
salary                  285
performancerating       200
worklifebalance         114
dtype: int64
-----------------------------------
share of nulls
department             81.406436
roledepartament        81.406436
hourlyrate             75.506555
businesstravel         47.735399
educationfield         46.126341
overtime               41.477950
maritalstatus          40.226460
totalworkingyears      32.717521
monthlyincome          29.141836
sameasmonthlyincome    29.141836
standardhours          20.917759
salary                 16.984505
performancerating      11.918951
worklifebalance         6.793802
dtype: float64

                    var  perc_nulos
0        businesstravel   47.735399
1            department   81.406436
2        educationfield   46.126341
3            hourlyrate   75.506555
4         maritalstatus   40.226460
5         monthlyincome   29.141836
6              overtime   41.477950
7     performancerating   11.918951
8         standardhours   20.917759
9     totalworkingyears   32.717521
10      worklifebalance    6.793802
11  sameasmonthlyincome   29.141836
12               salary   16.984505
13      roledepartament   81.406436

In [10]:
def detectar_duplicados(df):
    numero_duplicados = df.duplicated().sum()
    print(f"Filas duplicadas completas en el dataset: {numero_duplicados}")
    if numero_duplicados > 0:
        print("Aquí tienes las filas duplicadas:")
        print(df[df.duplicated()])

In [11]:
detectar_duplicados(df)

Filas duplicadas completas en el dataset: 0

### Exploramos columna por columna

In [12]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

### 'age'

In [13]:
df['age'].value_counts()

age
35              88
31              88
34              86
29              82
36              79
32              66
30              65
38              64
33              63
40              60
28              54
37              54
27              54
45              50
42              50
41              48
39              46
26              46
43              42
46              38
44              34
50              34
47              30
24              29
25              28
49              26
55              25
51              22
48              22
53              20
54              20
52              18
56              18
21              17
22              17
58              16
23              15
59              11
20              11
18               9
19               9
57               6
60               5
thirty-two       2
twenty-four      2
thirty           1
fifty-eight      1
fifty-two        1
twenty-six       1
fifty-five       1
thirty-seven     1
thirty-six       1
forty-seven      1
thirty-one       1
Name: count, dtype: int64

In [14]:
# transformamos las edades escritas en palabras a números
words_to_numbers = {
    'eighteen': 18,
    'nineteen': 19,
    'twenty': 20,
    'twenty-one': 21,
    'twenty-two': 22,
    'twenty-three': 23,
    'twenty-four': 24,
    'twenty-five': 25,
    'twenty-six': 26,
    'twenty-seven': 27,
    'twenty-eight': 28,
    'twenty-nine': 29,
    'thirty': 30,
    'thirty-one': 31,
    'thirty-two': 32,
    'thirty-three': 33,
    'thirty-four': 34,
    'thirty-five': 35,
    'thirty-six': 36,
    'thirty-seven': 37,
    'forty-seven': 47,
    'fifty-two': 52,
    'fifty-five': 55,
    'fifty-eight': 58
}

In [15]:
# reemplazamos palabras por números, y convertimos la columna a tipo numérico
df['age'] = df['age'].replace(words_to_numbers)
df['age'] = pd.to_numeric(df['age'], errors='coerce')

print(df['age'].dtype)
print(df['age'].value_counts().sort_index())

int64
age
18     9
19     9
20    11
21    17
22    17
23    15
24    31
25    28
26    47
27    54
28    54
29    82
30    66
31    89
32    68
33    63
34    86
35    88
36    80
37    55
38    64
39    46
40    60
41    48
42    50
43    42
44    34
45    50
46    38
47    31
48    22
49    26
50    34
51    22
52    19
53    20
54    20
55    26
56    18
57     6
58    17
59    11
60     5
Name: count, dtype: int64

### 'attrition'

In [16]:
df['attrition'].value_counts()

attrition
No     1406
Yes     272
Name: count, dtype: int64

In [17]:
df['attrition'] = df['attrition'].str.lower()
print(df['attrition'].value_counts())

attrition
no     1406
yes     272
Name: count, dtype: int64

### 'businesstravel'

In [18]:
df['businesstravel'].value_counts()

businesstravel
travel_rarely        616
travel_frequently    168
non-travel            93
Name: count, dtype: int64

In [19]:
df['businesstravel'] = df['businesstravel'].str.replace(' ', '_', regex=False)
df['businesstravel'] = df['businesstravel'].str.replace('-', '_', regex=False).str.lower()
print(df['businesstravel'].value_counts())

businesstravel
travel_rarely        616
travel_frequently    168
non_travel            93
Name: count, dtype: int64

### 'dailyrate'

In [20]:
df['dailyrate'].value_counts()

dailyrate
556.256661     326
290.035510     308
1032.487286    150
1582.771346     55
1973.984127     38
              ...
320.047619       1
470.063492       1
436.428571       1
501.325397       1
2004.785714      1
Name: count, Length: 673, dtype: int64

In [21]:
# reducimos a dos decimales los valores de la columna 'dailyrate'
df['dailyrate'] = df['dailyrate'].round(2)
print(df['dailyrate'].value_counts())

dailyrate
556.26     326
290.04     308
1032.49    150
1582.77     55
1973.98     38
          ...
320.05       1
470.06       1
436.43       1
501.33       1
2004.79      1
Name: count, Length: 673, dtype: int64

### 'department'

In [22]:
df['department'].value_counts()

department
Research & Development     203
Sales                       93
Human Resources             16
Name: count, dtype: int64

In [23]:
df['department'] = (
    df['department']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['department'].value_counts())

department
nan                       1366
research_&_development     203
sales                       93
human_resources             16
Name: count, dtype: int64

### 'distancefromhome'

In [24]:
df['distancefromhome'].value_counts()

distancefromhome
 2     228
 1     209
 9      89
 10     86
 8      85
      ...
-21      2
-34      2
-43      2
-39      1
-40      1
Name: count, Length: 69, dtype: int64

In [25]:
# pasamos la distancia a positivos, ya que hay valores negativos
df['distancefromhome'] = df['distancefromhome'].abs()
print(df['distancefromhome'].value_counts())

distancefromhome
2     228
1     209
10     92
9      89
8      85
7      82
3      79
5      65
4      64
6      63
24     37
16     37
12     33
13     33
11     33
18     32
15     31
25     31
26     30
29     30
23     30
14     28
19     23
20     23
17     22
21     22
22     21
28     20
27     18
47      8
35      8
38      7
31      6
36      6
42      6
45      6
48      5
37      5
46      5
32      4
41      4
30      4
33      3
44      3
34      2
49      2
43      2
39      1
40      1
Name: count, dtype: int64

### 'education'

In [26]:
df['education'].value_counts()

education
3    649
4    461
2    322
1    186
5     60
Name: count, dtype: int64

### 'educationfield'

In [27]:
df['educationfield'].value_counts()

educationfield
Life Sciences       367
Medical             286
Marketing           106
Technical Degree     70
Other                63
Human Resources      12
Name: count, dtype: int64

In [28]:
df['educationfield'] = (
    df['educationfield']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['educationfield'].value_counts())

educationfield
nan                 774
life_sciences       367
medical             286
marketing           106
technical_degree     70
other                63
human_resources      12
Name: count, dtype: int64

### 'employeecount'

In [29]:
df['employeecount'].value_counts()

employeecount
1    1678
Name: count, dtype: int64

In [30]:
# no aporta información útil, la eliminamos
df = df.drop(columns='employeecount')

### 'employeenumber'

In [31]:
df['employeenumber'].value_counts()

employeenumber
300     2
159     2
271     2
1158    2
191     2
       ..
547     1
546     1
545     1
544     1
1614    1
Name: count, Length: 1614, dtype: int64

In [32]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
8,8,41,no,NaN,1712.18,nan,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
1656,1656,41,no,NaN,1712.18,nan,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
60,60,36,no,NaN,610.17,nan,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1652,1652,36,no,NaN,610.17,nan,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1676,1676,47,no,travel_rarely,1032.49,nan,4,3,life_sciences,76,3,1,NaN,2,3,maNufACTURING DIREctOr,2,Divorced,"8339,32$","21682,23$",8,Yes,12,NaN,3,Part Time,1,NaN,4,"3,0",22,14,10,"8339,32$",1976,"100071,84$",NaN,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1638,1638,48,no,travel_rarely,417.96,nan,2,5,nan,1568,2,1,NaN,3,2,sALES EXEcuTIVe,4,Married,"3375,83$","8777,17$",2,No,14,"3,0",1,Part Time,1,"14,0",2,"3,0",9,6,7,"3375,83$",1975,"40510,00$",NaN,True
1657,1657,45,no,travel_rarely,495.75,nan,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1568,1568,45,no,travel_rarely,495.75,nan,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1671,1671,31,no,NaN,556.26,nan,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True
1607,1607,31,no,NaN,556.26,nan,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True

In [33]:
df = df.drop_duplicates()

In [34]:
df['employeenumber'].is_unique

False

In [35]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
8,8,41,no,NaN,1712.18,nan,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
1656,1656,41,no,NaN,1712.18,nan,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
60,60,36,no,NaN,610.17,nan,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1652,1652,36,no,NaN,610.17,nan,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1676,1676,47,no,travel_rarely,1032.49,nan,4,3,life_sciences,76,3,1,NaN,2,3,maNufACTURING DIREctOr,2,Divorced,"8339,32$","21682,23$",8,Yes,12,NaN,3,Part Time,1,NaN,4,"3,0",22,14,10,"8339,32$",1976,"100071,84$",NaN,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1638,1638,48,no,travel_rarely,417.96,nan,2,5,nan,1568,2,1,NaN,3,2,sALES EXEcuTIVe,4,Married,"3375,83$","8777,17$",2,No,14,"3,0",1,Part Time,1,"14,0",2,"3,0",9,6,7,"3375,83$",1975,"40510,00$",NaN,True
1657,1657,45,no,travel_rarely,495.75,nan,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1568,1568,45,no,travel_rarely,495.75,nan,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1671,1671,31,no,NaN,556.26,nan,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True
1607,1607,31,no,NaN,556.26,nan,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True

In [36]:
print(f"Número de employeenumber duplicados: {df.duplicated(subset='employeenumber').sum()}")

Número de employeenumber duplicados: 64

### 'environmentsatisfaction'

In [37]:
df['environmentsatisfaction'].value_counts()

environmentsatisfaction
4     483
3     471
2     316
1     306
35      7
12      7
14      6
13      6
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: count, dtype: int64

In [38]:
# detectamos valores no válidos, deberían ser del 1 al 4
df = df[df['environmentsatisfaction'].isin([1, 2, 3, 4])]

In [39]:
# sustituimos los valores numéricos por texto para una mejor comprensión
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['environmentsatisfaction'] = df['environmentsatisfaction'].replace(satisfaction_map)
print(df['environmentsatisfaction'].value_counts())

environmentsatisfaction
Very High    483
High         471
Medium       316
Low          306
Name: count, dtype: int64

In [40]:
df['environmentsatisfaction'] = (
    df['environmentsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['environmentsatisfaction'].value_counts())

environmentsatisfaction
very_high    483
high         471
medium       316
low          306
Name: count, dtype: int64

### 'gender'

In [41]:
df['gender'].value_counts()

gender
0    951
1    625
Name: count, dtype: int64

In [42]:
# típicamente, 0 es femenino y 1 es masculino. Aún así, comprobamos con la media de dailyrate, que suele ser más alta en hombres que en mujeres
df.groupby('gender')['dailyrate'].mean()

gender
0    660.307613
1    682.088064
Name: dailyrate, dtype: float64

In [43]:
gender_map = {
    0: 'Female',
    1: 'Male'
}

df['gender'] = df['gender'].replace(gender_map)
df['gender'].value_counts()

gender
Female    951
Male      625
Name: count, dtype: int64

In [44]:
df['gender'] = df['gender'].astype(str).str.lower()
print(df['gender'].value_counts())

gender
female    951
male      625
Name: count, dtype: int64

### 'hourlyrate'

In [45]:
df['hourlyrate'].value_counts()

hourlyrate
36.254439     72
69.532083     67
129.060911    39
197.846418    13
246.748016     8
              ..
54.914683      1
227.487103     1
78.180556      1
54.089286      1
133.159722     1
Name: count, Length: 180, dtype: int64

In [46]:
df['hourlyrate'] = df['hourlyrate'].round(2)

### 'jobinvolvement'

In [47]:
df['jobinvolvement'].value_counts()

jobinvolvement
3    941
2    393
4    157
1     85
Name: count, dtype: int64

In [48]:
# sustituimos los valores numéricos por texto para una mejor comprensión
jobinvolvement_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobinvolvement'] = df['jobinvolvement'].replace(jobinvolvement_map)
print(df['jobinvolvement'].value_counts())

jobinvolvement
High         941
Medium       393
Very High    157
Low           85
Name: count, dtype: int64

In [49]:
df['jobinvolvement'] = (
    df['jobinvolvement']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobinvolvement'].value_counts())

jobinvolvement
high         941
medium       393
very_high    157
low           85
Name: count, dtype: int64

### 'joblevel'

In [50]:
df['joblevel'].value_counts()

joblevel
1    579
2    574
3    240
4    108
5     75
Name: count, dtype: int64

In [51]:
# comprobamos la media de dailyrate por joblevel, para establecer una relación entre el nivel de trabajo y la remuneración
df.groupby('joblevel')['dailyrate'].mean()

joblevel
1     289.892470
2     556.357422
3    1032.618542
4    1586.816574
5    1971.413867
Name: dailyrate, dtype: float64

In [52]:
joblevel_map = {
    1: 'Entry Level',
    2: 'Intermediate',
    3: 'Senior',
    4: 'Manager',
    5: 'Executive'
}
df['joblevel'] = df['joblevel'].replace(joblevel_map)
print(df['joblevel'].value_counts())

joblevel
Entry Level     579
Intermediate    574
Senior          240
Manager         108
Executive        75
Name: count, dtype: int64

In [53]:
df['joblevel'] = (
    df['joblevel']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['joblevel'].value_counts())

joblevel
entry_level     579
intermediate    574
senior          240
manager         108
executive        75
Name: count, dtype: int64

### 'jobrole'

In [54]:
df['jobrole'].value_counts()

jobrole
mANager                    5
mAnageR                    3
ManagEr                    3
mAnaGeR                    3
maNaGeR                    3
                          ..
LabOrATory TEChNICiaN      1
SaLEs ExEcUTIVE            1
SalEs exECUTIvE            1
saLes eXeCutIvE            1
mAnUfactURInG DiRECTOr     1
Name: count, Length: 1481, dtype: int64

In [55]:
df['jobrole'] = df['jobrole'].str.strip().str.lower().str.title()
df['jobrole'].value_counts()

jobrole
Sales Executive              352
Research Scientist           302
Laboratory Technician        271
Manufacturing Director       157
Healthcare Representative    146
Manager                      111
Sales Representative          94
Research Director             87
Human Resources               56
Name: count, dtype: int64

In [56]:
df['jobrole'] = (
    df['jobrole']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobrole'].value_counts())

jobrole
sales_executive              352
research_scientist           302
laboratory_technician        271
manufacturing_director       157
healthcare_representative    146
manager                      111
sales_representative          94
research_director             87
human_resources               56
Name: count, dtype: int64

### 'jobsatisfaction'

In [57]:
df['jobsatisfaction'].value_counts()

jobsatisfaction
4    506
3    469
1    308
2    293
Name: count, dtype: int64

In [58]:
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobsatisfaction'] = df['jobsatisfaction'].replace(satisfaction_map)
print(df['jobsatisfaction'].value_counts())

jobsatisfaction
Very High    506
High         469
Low          308
Medium       293
Name: count, dtype: int64

In [59]:
df['jobsatisfaction'] = (
    df['jobsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobsatisfaction'].value_counts())

jobsatisfaction
very_high    506
high         469
low          308
medium       293
Name: count, dtype: int64

### 'maritalstatus'

In [60]:
df['maritalstatus'].value_counts()

maritalstatus
Married     419
Single      324
Divorced    183
divorced     11
Name: count, dtype: int64

In [61]:
df['maritalstatus'] = df['maritalstatus'].str.strip().str.lower()
print(df['maritalstatus'].value_counts())

maritalstatus
married     419
single      324
divorced    194
Name: count, dtype: int64

### 'monthlyincome'

In [62]:
df['monthlyincome'].value_counts()

monthlyincome
2342,59$     216
4492,84$     212
8339,32$     102
12783,92$     40
15943,72$     24
            ...
2663,33$       1
2095,00$       1
4573,33$       1
5228,33$       1
3705,83$       1
Name: count, Length: 464, dtype: int64

In [63]:
# transformamos la columna 'monthlyincome' para que sea numérica, eliminando el símbolo de dólar y la coma
df['monthlyincome'] = df['monthlyincome'].str.replace('$', '', regex=False)
df['monthlyincome'] = df['monthlyincome'].str.replace(',', '.', regex=False)
df['monthlyincome'] = pd.to_numeric(df['monthlyincome'], errors='coerce')

In [64]:
print(df['monthlyincome'].dtype)
df['monthlyincome'].describe()
df['monthlyincome'].value_counts()

float64

monthlyincome
2342.59     216
4492.84     212
8339.32     102
12783.92     40
15943.72     24
           ...
2663.33       1
2095.00       1
4573.33       1
5228.33       1
3705.83       1
Name: count, Length: 464, dtype: int64

### 'monthlyrate'

In [65]:
df['monthlyrate'].value_counts()

monthlyrate
11681,39$    303
6090,75$     294
21682,23$    142
33238,20$     52
41453,67$     36
            ...
14087,67$      1
16551,17$      1
10846,33$      1
9100,00$       1
9635,17$       1
Name: count, Length: 631, dtype: int64

In [66]:
# pasamos a str para corregir símbolos y puntos, luego convertimos a numérico
df['monthlyrate'] = df['monthlyrate'].astype(str)
df['monthlyrate'] = df['monthlyrate'].str.replace('$', '', regex=False)
df['monthlyrate'] = df['monthlyrate'].str.replace(',', '.', regex=False)
df['monthlyrate'] = pd.to_numeric(df['monthlyrate'], errors='coerce')
print(df['monthlyrate'].dtype)

float64

In [67]:
df['monthlyrate'].value_counts()

monthlyrate
11681.39    303
6090.75     294
21682.23    142
33238.20     52
41453.67     36
           ...
14087.67      1
16551.17      1
10846.33      1
9100.00       1
9635.17       1
Name: count, Length: 631, dtype: int64

### 'numcompaniesworked'

In [68]:
df['numcompaniesworked'].value_counts()

numcompaniesworked
1    568
0    216
3    164
4    156
2    154
7     81
6     68
5     63
9     54
8     52
Name: count, dtype: int64

### 'overtime'

In [69]:
df['overtime'].value_counts()

overtime
No     672
Yes    253
Name: count, dtype: int64

In [70]:
df['overtime'] = df['overtime'].str.strip().str.lower()
print(df['overtime'].value_counts())

overtime
no     672
yes    253
Name: count, dtype: int64

### 'percentsalaryhike'

In [71]:
# porcentaje de aumento salarial
df['percentsalaryhike'].value_counts()

percentsalaryhike
11    231
12    223
13    222
14    214
15    107
18     96
17     88
16     83
19     80
22     56
20     54
21     50
23     31
24     23
25     18
Name: count, dtype: int64

### 'performancerating'

In [72]:
df['performancerating'].value_counts()

performancerating
3,0    1184
4,0     205
Name: count, dtype: int64

In [73]:
# puede servir para descartar una hipótesis, por ejemplo: "¿El desempeño influye en que una persona se vaya o esté satisfecha?”

### 'relationshipsatisfaction'

In [74]:
df['relationshipsatisfaction'].value_counts()

relationshipsatisfaction
3    504
4    450
2    324
1    298
Name: count, dtype: int64

### 'standardhours'

In [75]:
df['standardhours'].value_counts()

standardhours
Part Time    867
Full Time    375
Name: count, dtype: int64

In [76]:
df['standardhours'] = (
    df['standardhours']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['standardhours'].value_counts())

standardhours
part_time    867
full_time    375
nan          334
Name: count, dtype: int64

### 'relationshipsatisfaction'

In [77]:
rel_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}
df['relationshipsatisfaction'] = df['relationshipsatisfaction'].replace(rel_map)
print(df['relationshipsatisfaction'].value_counts())

relationshipsatisfaction
High         504
Very High    450
Medium       324
Low          298
Name: count, dtype: int64

In [78]:
df['relationshipsatisfaction'] = (
    df['relationshipsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['relationshipsatisfaction'].value_counts())

relationshipsatisfaction
high         504
very_high    450
medium       324
low          298
Name: count, dtype: int64

### 'stockoptionlevel'

In [79]:
df[ 'stockoptionlevel'].value_counts()

stockoptionlevel
0    681
1    643
2    165
3     87
Name: count, dtype: int64

In [80]:
# Esta variable indica el nivel de opciones sobre acciones que tiene asignadas cada persona. Es decir, si reciben parte de su compensación en acciones de la empresa. Los niveles más altos suelen asignarse a empleados de mayor nivel o con mejor rendimiento.
# 0: No stock options / 1-3: Diferentes niveles de acciones asignadas

### 'totalworkingyears'

In [81]:
df['totalworkingyears'].value_counts()

totalworkingyears
10,0    142
6,0      82
8,0      80
9,0      65
5,0      65
7,0      55
4,0      51
1,0      50
3,0      33
12,0     31
11,0     30
20,0     29
14,0     29
13,0     29
16,0     28
15,0     27
18,0     25
21,0     23
17,0     23
2,0      20
22,0     19
19,0     15
24,0     14
23,0     12
28,0     12
26,0      8
0,0       8
37,0      7
36,0      6
27,0      6
25,0      6
33,0      6
29,0      5
31,0      4
40,0      4
32,0      3
35,0      3
30,0      3
34,0      2
38,0      1
Name: count, dtype: int64

In [82]:
df['totalworkingyears'].isna().sum()

515

In [83]:
df['totalworkingyears'] = (
    df['totalworkingyears']
    .astype(str)
    .replace('<NA>', np.nan)                   
    .str.replace(',', '.', regex=False)        
    .astype(float)
    .astype('Int64')                           
)
print(df['totalworkingyears'].dtype)
print(df['totalworkingyears'].value_counts())

Int64
totalworkingyears
10    142
6      82
8      80
9      65
5      65
7      55
4      51
1      50
3      33
12     31
11     30
20     29
14     29
13     29
16     28
15     27
18     25
21     23
17     23
2      20
22     19
19     15
24     14
23     12
28     12
26      8
0       8
37      7
36      6
27      6
25      6
33      6
29      5
31      4
40      4
32      3
35      3
30      3
34      2
38      1
Name: count, dtype: Int64

### 'trainingtimeslastyear'

In [84]:
df['trainingtimeslastyear'].value_counts()

trainingtimeslastyear
2    587
3    519
4    135
5    133
1     76
6     68
0     58
Name: count, dtype: int64

### 'worklifebalance'

In [85]:
df['worklifebalance'].value_counts()

worklifebalance
3,0    891
2,0    345
4,0    154
1,0     76
Name: count, dtype: int64

In [86]:
df['worklifebalance'].isna().sum()

110

In [87]:
df['worklifebalance'] = df['worklifebalance'].str.replace(',', '.').astype(float)

df['worklifebalance'] = df['worklifebalance'].replace({
    1.0: 'very_low',
    2.0: 'low',
    3.0: 'good',
    4.0: 'excellent'
})
print(df['worklifebalance'].value_counts())

worklifebalance
good         891
low          345
excellent    154
very_low      76
Name: count, dtype: int64

### 'yearsatcompany'

In [88]:
df['yearsatcompany'].value_counts()

yearsatcompany
5     203
1     168
3     142
2     137
10    132
7     107
4     104
8     104
9      92
6      78
0      46
11     35
20     29
13     26
15     20
14     18
22     17
12     14
18     14
16     14
21     13
19     12
17      9
24      7
33      5
25      5
36      4
26      4
32      3
31      3
40      3
23      2
27      2
30      1
34      1
37      1
29      1
Name: count, dtype: int64

### 'yearssincelastpromotion'

In [89]:
df['yearssincelastpromotion'].value_counts()

yearssincelastpromotion
0     615
1     369
2     174
7      89
4      68
3      60
5      48
6      37
11     25
8      21
9      18
15     15
14     11
12     11
13      8
10      7
Name: count, dtype: int64

### 'yearswithcurrmanager'

In [90]:
df['yearswithcurrmanager'].value_counts()

yearswithcurrmanager
2     367
0     269
7     255
3     147
8     116
4      98
1      83
9      66
5      37
10     32
6      30
11     21
12     20
13     16
17      7
15      5
14      4
16      3
Name: count, dtype: int64

### 'sameasmonthlyincome'

In [91]:
df['sameasmonthlyincome'].value_counts()

sameasmonthlyincome
2342,59$     216
4492,84$     212
8339,32$     102
12783,92$     40
15943,72$     24
            ...
2663,33$       1
2095,00$       1
4573,33$       1
5228,33$       1
3705,83$       1
Name: count, Length: 464, dtype: int64

In [92]:
# eliminamos porque es una copia de 'monthlyincome'
df.drop(columns='sameasmonthlyincome', inplace=True)

### 'datebirth'

In [93]:
df['datebirth'].value_counts()

datebirth
1992    87
1988    81
1994    78
1989    78
1987    72
1991    66
1985    64
1993    60
1990    58
1983    55
1986    53
1995    50
1996    50
1981    49
1978    46
1997    45
1982    45
1984    42
1980    41
1977    35
1979    32
1976    31
1973    30
1999    29
1998    27
1968    24
1974    23
1975    21
1969    20
1970    20
1972    18
1967    18
1971    17
2002    17
1965    16
2001    15
2000    14
2003    11
1964    10
2004     9
2005     9
1966     6
1963     4
Name: count, dtype: int64

In [94]:
df['datebirth'].describe()

count    1576.000000
mean     1986.093909
std         9.164531
min      1963.000000
25%      1980.000000
50%      1987.000000
75%      1993.000000
max      2005.000000
Name: datebirth, dtype: float64

### 'salary'

In [95]:
df['salary'].value_counts()

salary
53914,11$     250
28111,13$     244
100071,84$    115
153407,07$     42
191324,62$     26
             ...
31020,00$       1
135250,00$      1
76390,00$       1
49630,00$       1
44470,00$       1
Name: count, Length: 547, dtype: int64

In [96]:
# nos aseguramos de que sea tipo texto
df['salary'] = df['salary'].astype(str)

# eliminamos el símbolo $ y reemplazamos la coma por punto
df['salary'] = df['salary'].str.replace('$', '', regex=False)
df['salary'] = df['salary'].str.replace(',', '.', regex=False)

# convertimos a número decimal (float)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
print(df['salary'].dtype)
print(df['salary'].value_counts())

float64
salary
53914.11     250
28111.13     244
100071.84    115
153407.07     42
191324.62     26
            ...
31020.00       1
135250.00      1
76390.00       1
49630.00       1
44470.00       1
Name: count, Length: 547, dtype: int64

### 'roledepartament'

In [97]:
df['roledepartament'].value_counts()

roledepartament
LaBoratory TECHnICIAn  -  Research & Development         2
LaborAtorY Technician  -  Research & Development         2
resEaRcH scIENTiSt  -  Research & Development            2
labORAtoRy tEcHNICIAN  -  Research & Development         2
Sales exECutIVE  -  Sales                                2
                                                        ..
HealthcARE RePreSENtAtiVe  -  Research & Development     1
ResEArch ScieNTiST  -  Research & Development            1
labORaTORy TecHniciAN  -  Research & Development         1
SalEs exECUTIvE  -  Sales                                1
sAleS EXECUtIvE  -  Sales                                1
Name: count, Length: 277, dtype: int64

In [98]:
# ya tenemos las columnas 'jobrole' y 'department', así que eliminamos esta columna, que tiene un alto porcentaje de nulos
df.drop(columns='roledepartament', inplace=True)

### 'remotework'

In [99]:
df['remotework'].value_counts()

remotework
1        354
True     340
False    300
0        300
Yes      282
Name: count, dtype: int64

In [100]:
# Convertimos todo a string para estandarizar
df['remotework'] = df['remotework'].astype(str).str.strip().str.lower()

# Reemplazamos todas las variantes por 'yes' o 'no'
df['remotework'] = df['remotework'].replace({
    '1': 'yes',
    'true': 'yes',
    'yes': 'yes',
    '0': 'no',
    'false': 'no'
})
print(df['remotework'].value_counts())

remotework
yes    976
no     600
Name: count, dtype: int64

In [101]:
df = df.drop(columns=['Unnamed: 0'])

In [102]:
df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime',
       'percentsalaryhike', 'performancerating', 'relationshipsatisfaction',
       'standardhours', 'stockoptionlevel', 'totalworkingyears',
       'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany',
       'yearssincelastpromotion', 'yearswithcurrmanager', 'datebirth',
       'salary', 'remotework'],
      dtype='object')